newwms_gift/src/Catalogs/КлассификаторСтранМира/КлассификаторСтранМира.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторСтранМира</name>
  <comment>(Общ)</comment>
  <predefined>
    <items>
      <name>ЛицоБезГражданства</name>
      <description>Лицо без гражданства</description>
    </items>
    <items>
      <name>Россия</name>
      <description>РОССИЯ</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодАльфа2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

newwms_gift/src/Catalogs/КлассификаторСтранМира/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПолучитьИзКлассификатора(Команда)
	ОткрытьФорму("Справочник.КлассификаторСтранМира.Форма.ФормаПодбораИзКлассификатора",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы="Справочник.КлассификаторСтранМира.Форма.ФормаПодбораИзКлассификатора" Тогда
		Объект.Код=ВыбранноеЗначение.КодЧисловой;
		Объект.Наименование=ВыбранноеЗначение.НаименованиеКраткое;
		Объект.НаименованиеПолное= ВыбранноеЗначение.НаименованиеПолное;
		Объект.КодАльфа2=ВыбранноеЗначение.КодАльфа2;
	КонецЕсли;
КонецПроцедуры
